<a href="https://colab.research.google.com/github/acflippo/PyLadies_LA_USC_prez_2025_04/blob/main/PyladiesLA_using_SQL_in_Python_colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Introduction to SQL Sub-Queries

This notebook explore the basics of the use of sub-queries with SQL

In [1]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(team text,
  country text,
  season integer,
  total_goals integer);
'''
)

conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [2]:
# INSERTING VALUES
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")

conn.commit()

In [3]:
# Average goal by team

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Barcelona', 46.0)
('Real Madrid', 51.0)

In [4]:
# First try to filter the teams with average goals higher than 50
# This query will generate an error

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team AS team_name,
                                 avg(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team
                          HAVING avg_goals > 50;
                          ''')

for row in cursor:
    print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

In [5]:
# Now, the correct query, using the appropriate sub-query

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_name, avg_goals
                          FROM (

                          -- Here we make our sub-query:
                            SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                            FROM team_data
                            GROUP BY team) tp
                          -- End of the sub-query

                          WHERE avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

## Exercise

Now, it's your turn.  Try your hands on the following exercises.

In [6]:
# Create a table called users with 4 columns
# user_id int
# name text
# status text
# country text

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS
   [ToDo: Enter Code Here]);
'''
)

conn.commit()

print("Table created successfully");

conn.close()

In [ ]:
# INSERTING VALUES into users table

# insert into users values (10, 'Brad Pitt', 'open', 'USA');
# insert into users values (11, 'Nicole Kidman', 'closed', 'Australia');
# insert into users values (12, 'Mike Myers', 'open', 'Canada');
# insert into users values (13, 'Chris Hemsworth', 'open', 'Australia');
# insert into users values (14, 'Morgan Freman', 'closed', 'USA');
# insert into users values (15, 'Keanu Reeves', 'open', 'USA');
# insert into users values (16, 'Winona Ryder', 'open', 'USA');
# insert into users values (17, 'Jackie Chan', 'open', 'China');
# insert into users values (18, 'Dwayne Johnsn', 'closed', 'USA');
# insert into users values (19, 'Hugh Jackman', 'open', 'Australia');
# insert into users values (20, 'Jimin', 'open', 'South Korea');
# insert into users values (21, 'Song Kan', 'closed', 'South Korea');
# insert into users values (22, 'Lee Kang-in', 'open', 'South Korea');
# insert into users values (23, 'Takeshi Kitano', 'closed', 'Japan');
# insert into users values (24, 'Yoko Ono', 'closed', 'Japan');
# insert into users values (25, 'Ken Watanabe', 'open', 'Japan');
# insert into users values (26, 'Emma Stone', 'open', 'USA');
# insert into users values (27, 'Meg Ryan', 'closed', 'USA');
# insert into users values (28, 'Jason Momoa', 'open', 'USA');
# insert into users values (29, 'Harrison Ford', 'closed', 'USA');
# insert into users values (30, 'Anna Kendrick', 'open', 'USA');
# insert into users values (31, 'Matt Damon', 'closed', 'USA');
# insert into users values (32, 'Kristen Bell', 'closed', 'USA');
# insert into users values (35, 'Chris Pratt', 'open', 'USA');
# insert into users values (36, 'Zoe Saldana', 'closed', 'USA');
# insert into users values (37, 'Chadwick Boseman', 'open', 'USA');
# insert into users values (38, 'Damon Wayans Jr.', 'open', 'USA');
# insert into users values (39, 'Mark Ruffalo', 'closed', 'USA');
# insert into users values (40, 'Keith Urban', 'open', 'Australia');
# insert into users values (41, 'Eric Bana', 'closed', 'Australia');
# insert into users values (42, 'Bae Suzy', 'open', 'South Korea');
# insert into users values (43, 'Lee Min-ho', 'open', 'South Korea');
# insert into users values (44, 'Bai Ling', 'open', 'China');
# insert into users values (45, 'Michelle Yeoh', 'open', 'Malaysia');
# insert into users values (46, 'Henry Golding', 'open', 'Malaysia');
# insert into users values (47, 'Amber Chia', 'closed', 'Malaysia');
# insert into users values (48, 'Drake', 'open', 'Canada');
# insert into users values (49, 'Celine Dion', 'closed', 'Canada');
# insert into users values (50, 'Ray Gosling', 'open', 'Canada');
# insert into users values (51, 'Jet Li', 'open', 'China');
# insert into users values (52, 'William Chan', 'closed', 'China');


conn = sqlite3.connect('test.db')

conn.execute("[TODO: Add insert statements here];")
# conn.execute("[TODO: Add insert statements here];")
# conn.execute("[TODO: Add insert statements here];")


conn.commit()

In [ ]:
# Answer the following question
# How many users are there for each country?

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' [TODO: Write your query here] ''')

for row in cursor:
    print(row)
conn.close()